{
  "section": {
    "label": "Timeline",
    "title": "Evolution Path",
    "now": "Now",
    "close": "Close",
    "viewProducts": "View products"
  },
  "experiences": [
    {
      "type": "product",
      "title": "Proxy Cosmos",
      "description": "Proxy Cosmos is my 2025 research agent that crawls, tags, and converses over frontier AI infrastructure briefs. I am building it as a living dossier so founders, PMFs, and investors can query live narratives about modular agents, synthetic data supply chains, and the control planes that stitch them together.",
      "period": "2025 - now",
      "skills": ["Agents", "Infra Research", "Next.js", "AI"],
      "context": "I treat Proxycosmos like a field lab for agentic research ops, letting me turn raw interviews, forum scrapes, and protocol docs into structured questions a model can reason over in seconds."
    },
    {
      "type": "product",
      "title": "VisibleBase",
      "description": "VisibleBase is my 2025 experiment to make early-stage signals legible and micro-backing practical. It reimagines discovery and financing as an AI-agent flywheel: product pages auto-explain hypotheses, signal layers quantify community conviction, and funding rails tokenize future upside so anyone can back a hunch.",
      "period": "2025 - now",
      "skills": ["AI Agents", "Signal Graphs", "Micro Funding", "On-chain"],
      "context": "Scout, Analyst, Match, and Crowd agents run in tandem to surface frontier teams before pitch decks exist, replacing opaque VC decisions with transparent signal streams and programmable incentives."
    },
    {
      "type": "work",
      "title": "CMOCHAT Global Marketing Resource Platform",
      "company": "CMOCHAT",
      "description": "I launched CMOCHAT in 2025 as a global marketing resource matching platform. I lead product strategy, the data model, and the AI matching engine, structuring the scattered data of CMOs, agencies, channels, and tools worldwide while building a conversational growth cockpit that turns any business goal into an executable go-to-market playbook. I also designed the lead scoring system, incentive mechanics, and settlement tooling so a founding team can move from brief to closed transaction within a week.",
      "period": "2025 - now",
      "skills": ["MarTech", "AI Matching", "Growth Strategy", "Product Strategy"],
      "context": "I now operate like a systems architect for go-to-market teams--mapping the flow of metrics, capital, talent, and narrative into a welded growth stack."
    },
    {
      "type": "work",
      "title": "Data Analytics & Product Research",
      "company": "Gaorong Capital",
      "description": "I spent a year embedded in Gaorong Capital's AI research team, dissecting tracks such as AI coding, enterprise applications, and Agent Coin from an investor's perspective. I built data warehouses, mapped entire ecosystems, wrote industry reports, and partnered with portfolio founders on KPI dashboards. I conducted in-depth founder interviews, evaluated technical roadmaps, and used model benchmarks plus case reviews to estimate product ceilings, then distilled the findings into internal research baselines and due diligence checklists.",
      "period": "2024",
      "skills": ["Case Studies", "Python", "Industry Reports", "Web Scraping"],
      "context": "Working shoulder to shoulder with top-tier investors showed me how product intuition, data, and capital cadence pull against one another, and it trained me to spot the product signals worth amplifying through a fund's lens."
    },
    {
      "type": "work",
      "title": "Founder & Developer",
      "company": "Genesis Cosmos",
      "description": "I founded Genesis Cosmos with partners and launched Jezzlab, an AI-native creative platform. I orchestrated the product blueprint, interaction language, and agent workflows, introducing concepts such as a worldview operating system and character-generation rails so creators could turn narrative assets into collaborative, systemized tools. We adopted a local-first architecture to protect privacy, layered in visual prompt debugging, multi-writer storyline versioning, and subscription commercialization, and secured the first wave of high-paying users with a tiny team.",
      "period": "2024 - now",
      "skills": ["React", "TypeScript", "Node.js", "AI", "Agent", "Creative Direction", "Content"],
      "context": "This proved that a six-person squad, leaning on structured design and rapid iteration, can rewrite how creators and AI collaborate."
    },
    {
      "type": "product",
      "title": "Jezzlab",
      "company": "Genesis Cosmos",
      "description": "Jezzlab is our AI-native creative system that lets narrative teams script, version, and deploy characters and worlds like reusable software. I own the product loop, from the worldview operating system to the agent rails that auto-produce moodboards, lore, and monetization hooks for each IP.",
      "period": "2024 - now",
      "skills": ["Product Systems", "AI Agents", "Creative Ops", "Subscription GTM"],
      "context": "Jezzlab keeps me honest about how fast small teams need to ship—every sprint blends creative direction, infra, billing, and growth into one stack so nothing gets lost between departments."
    },
    {
      "type": "work",
      "title": "Independent Developer",
      "description": "Since 2023 I have worked full time as an independent developer, building a solo pipeline that runs research, prototyping, validation, and operations end to end. I shipped the Ghostie desktop agent, the AI Markdown tool Mdrone, automation agent kits for finance, and documented the information architecture, prompt templates, and rapid deployment methods behind custom agents. I regularly attack hackathons and online challenges, compressing product positioning, engineering, and growth experiments into 48-hour validation loops.",
      "period": "2023 - now",
      "skills": ["React", "TypeScript", "Node.js", "AWS"],
      "context": "I rebuilt my engineering stack end to end so research, design, code, ops, and retros all sit in my own loop, letting me turn any idea into a demoable or billable artifact within a week."
    },
    {
      "type": "study",
      "title": "Architect & Designer",
      "company": "ZIAD",
      "description": "Six years in the Tianjin University School of Architecture plus hands-on work at the Zhejiang Provincial Institute of Architectural Design taught me to run system simulations and narrative design at the urban scale while mastering parametric modeling, material research, and user flow analysis. I drove multiple landmark projects from competition concept through construction drawings and began coding during this period, using Rhinoceros, Grasshopper, and Python for generative design, which later became the muscle behind my AI and product work.",
      "period": "2017 - 2022",
      "skills": ["Rhinoceros", "Grasshopper", "Python", "Urban Design", "Human Factors Engineering"],
      "context": "Architecture trained me to balance constraints, rituals, and aesthetics long before I wrote production code, which is why I still prioritize cadence, narrative, and structure when I design products."
    }
  ]
}
